Created frontend using next.js and tanstack
